XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.S32_SDK_DFP.pdsc
          <!-- 112MHz 100LQFP -->
          <variant Dvariant="S32K144UNxxxLLx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00004000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF9000" size="0x00007000" init="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K144URxxxLLx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K144UFxxxLLx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K144USxxxLLx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="S32K144UAxxxLLx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init="0" default="0"/>
            <feature type="QFP" n="100"/>
          </variant>

          <!-- *********************** -->
          <!-- 64MHz 100MAPBGA -->
          <variant Dvariant="S32K144MNxxxMHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00004000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF9000" size="0x00007000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144MRxxxMHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144MFxxxMHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144MSxxxMHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144MAxxxMHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>

          <!-- 80MHz 100MAPBGA -->
          <variant Dvariant="S32K144HNxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00004000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF9000" size="0x00007000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144HRxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144HFxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144HSxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144HAxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>

          <!-- 112MHz 100MAPBGA -->
          <variant Dvariant="S32K144UNxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00004000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF9000" size="0x00007000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144URxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144UFxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144USxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K144UAxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
        </device>

