XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.S32_SDK_DFP.pdsc
          <!-- 112MHz 144LQFP -->
          <variant Dvariant="S32K146UNxxxLQx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K146URxxxLQx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K146UFxxxLQx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K146USxxxLQx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K146UAxxxLQx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>

          <!-- *********************** -->
          <!-- 64MHz 100MAPBGA -->
          <variant Dvariant="S32K146MNxxxMHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K146MRxxxMHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K146MFxxxMHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K146MSxxxMHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K146MAxxxMHx">
            <processor Dclock="64000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>

          <!-- 80MHz 100MAPBGA -->
          <variant Dvariant="S32K146HNxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K146HRxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K146HFxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K146HSxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K146HAxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>

          <!-- 112MHz 100MAPBGA -->
          <variant Dvariant="S32K146UNxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K146URxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K146UFxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K146USxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K146UAxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0000F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF0000" size="0x00010000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
        </device>

