XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.S32_SDK_DFP.pdsc
        <!-- ******************************  Device 'S32K148'  ****************************** -->
        <device Dname="S32K148">
          <book name="doc/S32SDK_S32K148_UserManual.pdf" title="S32SDK User Manual"/>

          <compile header="platform/devices/device_registers.h"/> <!-- generates warning in PackCheck because name is not CMSIS conform -->
          <compile define="CPU_S32K148"/>
          <debug  svd="platform/devices/S32K148/S32K148.svd"/>
          <memory id="IROM1"                                      start="0x00000000" size="0x00180000" default="1" startup="1"/>
          <memory id="IROM2"                                      start="0x10000000" size="0x00080000" default="0" startup="1"/>
          <algorithm name="CMSIS/Flash/S32K148_P1536_4KB_SEC.FLM" start="0x00000000" size="0x00180000" default="1"/>
          <algorithm name="CMSIS/Flash/S32K148_D512_4KB_SEC.FLM"  start="0x10000000" size="0x00080000" default="0"/>

          <!-- *********************** -->
          <!-- 80MHz 144LQFP -->
          <variant Dvariant="S32K148HNxxxLQx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00017000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE8000" size="0x00018000" init="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148HRxxxLQx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148HFxxxLQx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148HSxxxLQx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148HAxxxLQx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148HExxxLQx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148HJxxxLQx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>

          <!-- 112MHz 144LQFP -->
          <variant Dvariant="S32K148UNxxxLQx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00017000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE8000" size="0x00018000" init="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148URxxxLQx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148UFxxxLQx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148USxxxLQx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148UAxxxLQx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148UExxxLQx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>
          <variant Dvariant="S32K148UJxxxLQx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="144"/>
          </variant>

          <!-- *********************** -->
          <!-- 80MHz 176LQFP -->
          <variant Dvariant="S32K148HNxxxLUx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00017000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE8000" size="0x00018000" init="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148HRxxxLUx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148HFxxxLUx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148HSxxxLUx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148HAxxxLUx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148HExxxLUx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148HJxxxLUx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>

          <!-- 112MHz 176LQFP -->
          <variant Dvariant="S32K148UNxxxLUx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00017000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE8000" size="0x00018000" init="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148URxxxLUx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148UFxxxLUx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148USxxxLUx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148UAxxxLUx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148UExxxLUx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>
          <variant Dvariant="S32K148UJxxxLUx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="QFP" n="176"/>
          </variant>


          <!-- *********************** -->
          <!-- 80MHz 100MAPBGA -->
          <variant Dvariant="S32K148HNxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00017000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE8000" size="0x00018000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148HRxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148HFxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148HSxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148HAxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148HExxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148HJxxxMHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>

          <!-- 112MHz 100MAPBGA -->
          <variant Dvariant="S32K148UNxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00017000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE8000" size="0x00018000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148URxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148UFxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148USxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148UAxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148UExxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="S32K148UJxxxMHx">
            <processor Dclock="112000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x0001F000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFE0000" size="0x00020000" init="0" default="0"/>
            <feature type="BGA" n="100"/>
          </variant>
        </device>

        <!-- ******************************  Device 'S32K142W'  ***************************** -->
        <device Dname="S32K142W">
          <book name="doc/S32SDK_S32K142W_UserManual.pdf" title="S32SDK User Manual"/>

          <compile header="platform/devices/device_registers.h"/> <!-- generates warning in PackCheck because name is not CMSIS conform -->
          <compile define="CPU_S32K142W"/>
          <debug  svd="platform/devices/S32K142W/S32K142W.svd"/>
          <memory id="IROM1"                                     start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <algorithm name="CMSIS/Flash/S32K142_P256_2KB_SEC.FLM" start="0x00000000" size="0x00040000" default="1"/>

          <!-- *********************** -->
          <!-- 80MHz 48LQFP -->
          <variant Dvariant="S32K142WFxxxLFx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init="0" default="0"/>
            <feature type="QFP" n="48"/>
          </variant>
          <variant Dvariant="S32K142WAxxxLFx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init="0" default="0"/>
            <feature type="QFP" n="48"/>
          </variant>

          <!-- *********************** -->
          <!-- 80MHz 64LQFP -->
          <variant Dvariant="S32K142WFxxxLHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K142WAxxxLHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00003000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFFC000" size="0x00004000" init="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
        </device>

        <!-- ******************************  Device 'S32K144W'  ***************************** -->
        <device Dname="S32K144W">
          <book name="doc/S32SDK_S32K144W_UserManual.pdf" title="S32SDK User Manual"/>

          <compile header="platform/devices/device_registers.h"/> <!-- generates warning in PackCheck because name is not CMSIS conform -->
          <compile define="CPU_S32K144W"/>
          <debug  svd="platform/devices/S32K144W/S32K144W.svd"/>
          <memory id="IROM1"                                     start="0x00000000" size="0x00080000" default="1" startup="1"/>
          <algorithm name="CMSIS/Flash/S32K144_P512_4KB_SEC.FLM" start="0x00000000" size="0x00080000" default="1"/>

          <!-- *********************** -->
          <!-- 80MHz 48LQFP -->
          <variant Dvariant="S32K144WFxxxLFx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init="0" default="0"/>
            <feature type="QFP" n="48"/>
          </variant>
          <variant Dvariant="S32K144WAxxxLFx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init="0" default="0"/>
            <feature type="QFP" n="48"/>
          </variant>

          <!-- *********************** -->
          <!-- 80MHz 64LQFP -->
          <variant Dvariant="S32K144WFxxxLHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF9000" size="0x00008000" init="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="S32K144WAxxxLHx">
            <processor Dclock="80000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00007000" init="0" default="1"/>
            <memory id="IRAM2" start="0x1FFF8000" size="0x00008000" init="0" default="0"/>
            <feature type="QFP" n="64"/>
          </variant>
        </device>

      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Device Conditions -->
    <condition id="S32K14x">
      <description>NXP S32K14x devices</description>
      <accept condition="S32K142"/>
      <accept condition="S32K144"/>
      <accept condition="S32K146"/>
      <accept condition="S32K148"/>
      <accept condition="S32K142W"/>
      <accept condition="S32K144W"/>
      <!--accept condition="next device with same coreclock"/-->
    </condition>

