XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.S32_SDK_DFP.pdsc
    <condition id="S32K142_144_146">
      <description>NXP S32K142 144 146 devices</description>
      <accept condition="S32K142"/>
      <accept condition="S32K144"/>
      <accept condition="S32K146"/>
      <accept condition="S32K142W"/>
      <accept condition="S32K144W"/>
    </condition>

    <condition id="S32K142">
      <description>NXP S32K142 device</description>
      <accept Dvendor="NXP:11" Dname="S32K142*"/>
      <deny   Dvendor="NXP:11" Dname="S32K142W*"/>
    </condition>
    <condition id="S32K142_32">
      <description>NXP S32K142 device with 32K RAM</description>
      <accept Dvendor="NXP:11" Dname="S32K142[MHU][RFSA]*"/>
    </condition>

    <condition id="S32K144">
      <description>NXP S32K144 device</description>
      <accept Dvendor="NXP:11" Dname="S32K144*"/>
      <deny   Dvendor="NXP:11" Dname="S32K144W*"/>
    </condition>
    <condition id="S32K144_48">
      <description>NXP S32K144 device with 48K RAM</description>
      <accept Dvendor="NXP:11" Dname="S32K144[MHU]N*"/>
    </condition>
    <condition id="S32K144_64">
      <description>NXP S32K144 device with 64K RAM</description>
      <accept Dvendor="NXP:11" Dname="S32K144[MHU][RFSA]*"/>
    </condition>

    <condition id="S32K146">
      <description>NXP S32K146 device</description>
      <accept Dvendor="NXP:11" Dname="S32K146*"/>
    </condition>
    <condition id="S32K146_128">
      <description>NXP S32K146 device with 128K RAM</description>
      <accept Dvendor="NXP:11" Dname="S32K146[MHU][NRFSA]*"/>
    </condition>

    <condition id="S32K148">
      <description>NXP S32K148 device</description>
      <accept Dvendor="NXP:11" Dname="S32K148*"/>
    </condition>
    <condition id="S32K148_192">
      <description>NXP S32K144 device with 192K RAM</description>
      <accept Dvendor="NXP:11" Dname="S32K148[MHU]N*"/>
    </condition>
    <condition id="S32K148_256">
      <description>NXP S32K144 device with 256K RAM</description>
      <accept Dvendor="NXP:11" Dname="S32K148[MHU][RFSAEJ]*"/>
    </condition>

    <condition id="S32K142W">
      <description>NXP S32K142W device</description>
      <accept Dvendor="NXP:11" Dname="S32K142W*"/>
    </condition>
    <condition id="S32K142W_32">
      <description>NXP S32K142W device with 32K RAM</description>
      <accept Dvendor="NXP:11" Dname="S32K142W[FA]*"/>
    </condition>

    <condition id="S32K144W">
      <description>NXP S32K144W device</description>
      <accept Dvendor="NXP:11" Dname="S32K144W*"/>
    </condition>
    <condition id="S32K144W_64">
      <description>NXP S32K144W device with 64K RAM</description>
      <accept Dvendor="NXP:11" Dname="S32K144W[FA]*"/>
    </condition>

    <!-- Device + Compiler Conditions (ARM) -->
    <condition id="S32K142_ARM">
      <description>NXP S32K142 device and ARM compiler</description>
      <require condition="S32K142"/>
      <require Tcompiler="ARMCC" Toptions="AC6"/>
    </condition>
    <condition id="S32K142_32_ARM">
      <description>NXP S32K142 device with 32K RAM and ARM compiler</description>
      <require condition="S32K142_32"/>
      <require Tcompiler="ARMCC" Toptions="AC6"/>
    </condition>

    <condition id="S32K144_ARM">
      <description>NXP S32K144 device and ARM compiler</description>
      <require condition="S32K144"/>
      <require Tcompiler="ARMCC" Toptions="AC6"/>
    </condition>
    <condition id="S32K144_48_ARM">
      <description>NXP S32K144 device with 48K RAM and ARM compiler</description>
      <require condition="S32K144_48"/>
      <require Tcompiler="ARMCC" Toptions="AC6"/>
    </condition>
    <condition id="S32K144_64_ARM">
      <description>NXP S32K144 device with 64K RAM and ARM compiler</description>
      <require condition="S32K144_64"/>
      <require Tcompiler="ARMCC" Toptions="AC6"/>
    </condition>

    <condition id="S32K146_ARM">
      <description>NXP S32K146 devices and ARM compiler</description>
      <require condition="S32K146"/>
      <require Tcompiler="ARMCC" Toptions="AC6"/>
    </condition>
    <condition id="S32K146_128_ARM">
      <description>NXP S32K146 device with 128K RAM and ARM compiler</description>
      <require condition="S32K146_128"/>
      <require Tcompiler="ARMCC" Toptions="AC6"/>
    </condition>

    <condition id="S32K148_ARM">
      <description>NXP S32K148 device and ARM compiler</description>
      <require condition="S32K148"/>
      <require Tcompiler="ARMCC" Toptions="AC6"/>
    </condition>
    <condition id="S32K148_192_ARM">
      <description>NXP S32K144 device with 192K RAM and ARM compiler</description>
       <require condition="S32K148_192"/>
      <require Tcompiler="ARMCC" Toptions="AC6"/>
   </condition>
    <condition id="S32K148_256_ARM">
      <description>NXP S32K144 device with 256K RAM and ARM compiler</description>
      <require condition="S32K148_256"/>
      <require Tcompiler="ARMCC" Toptions="AC6"/>
    </condition>

    <condition id="S32K142W_ARM">
      <description>NXP S32K142W device and ARM compiler</description>
      <require condition="S32K142W"/>
      <require Tcompiler="ARMCC" Toptions="AC6"/>
    </condition>
    <condition id="S32K142W_32_ARM">
      <description>NXP S32K142W device with 32K RAM and ARM compiler</description>
      <require condition="S32K142W_32"/>
      <require Tcompiler="ARMCC" Toptions="AC6"/>
    </condition>

    <condition id="S32K144W_ARM">
      <description>NXP S32K144W devices and ARM compiler</description>
      <require condition="S32K144W"/>
      <require Tcompiler="ARMCC" Toptions="AC6"/>
    </condition>
    <condition id="S32K144W_64_ARM">
      <description>NXP S32K144W device with 64K RAM and ARM compiler</description>
      <require condition="S32K144W_64"/>
      <require Tcompiler="ARMCC" Toptions="AC6"/>
    </condition>

    <!-- Device + Compiler Conditions (GCC) -->
    <condition id="S32K142_GCC">
      <description>NXP S32K142 device and GCC compiler</description>
      <require condition="S32K142"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="S32K142_32_GCC">
      <description>NXP S32K142 device with 32K RAM and GCC compiler</description>
      <require condition="S32K142_32"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="S32K144_GCC">
      <description>NXP S32K144 device and GCC compiler</description>
      <require condition="S32K144"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="S32K144_48_GCC">
      <description>NXP S32K144 device with 48K RAM and GCC compiler</description>
      <require condition="S32K144_48"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="S32K144_64_GCC">
      <description>NXP S32K144 device with 64K RAM and GCC compiler</description>
      <require condition="S32K144_64"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="S32K146_GCC">
      <description>NXP S32K146 devices and GCC compiler</description>
      <require condition="S32K146"/>
      <require Tcompiler="GCC"/>
    </condition>
