XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.S32_SDK_DFP.pdsc
    <condition id="S32K146_128_GCC">
      <description>NXP S32K146 device with 128K RAM and GCC compiler</description>
      <require condition="S32K146_128"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="S32K148_GCC">
      <description>NXP S32K148 device and GCC compiler</description>
      <require condition="S32K148"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="S32K148_192_GCC">
      <description>NXP S32K144 device with 192K RAM and GCC compiler</description>
       <require condition="S32K148_192"/>
      <require Tcompiler="GCC"/>
   </condition>
    <condition id="S32K148_256_GCC">
      <description>NXP S32K144 device with 256K RAM and GCC compiler</description>
      <require condition="S32K148_256"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="S32K142W_GCC">
      <description>NXP S32K142W device and GCC compiler</description>
      <require condition="S32K142W"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="S32K142W_32_GCC">
      <description>NXP S32K142W device with 32K RAM and GCC compiler</description>
      <require condition="S32K142W_32"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="S32K144W_GCC">
      <description>NXP S32K144W devices and GCC compiler</description>
      <require condition="S32K144W"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="S32K144W_64_GCC">
      <description>NXP S32K144W device with 64K RAM and GCC compiler</description>
      <require condition="S32K144W_64"/>
      <require Tcompiler="GCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="S32K14x_CMSIS">
      <description>NXP S32K14x devices and CMSIS-CORE</description>
      <accept condition="S32K14x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- bundle dependencies -->
    <condition id="S32K144 DRV_CLOCK_PINS">
      <description>NXP S32K Driver Clock Pins dependency</description>
      <require condition="S32K144"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="PINS"/>
    </condition>
    <condition id="S32K144 DRV_CLOCK_PINS_ADC">
      <description>NXP S32K Driver Clock Pins ADC dependency</description>
      <require condition="S32K144"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="PINS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="ADC"/>
    </condition>
    <condition id="S32K148 DRV_CLOCK_PINS">
      <description>NXP S32K Driver Clock Pins dependency</description>
      <require condition="S32K148"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="PINS"/>
    </condition>
    <condition id="S32K148 DRV_CLOCK_PINS_ADC">
      <description>NXP S32K Driver Clock Pins ADC dependency</description>
      <require condition="S32K148"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="PINS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="ADC"/>
    </condition>

    <!-- SDK driver dependencies -->
    <condition id="S32K14x DRV_ADC">
      <description>NXP S32K Driver ADC dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
    </condition>
    <condition id="S32K14x DRV_Clock">
      <description>NXP S32K System Clock dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K14x DRV_CMP">
      <description>NXP S32K Driver CMP dependency</description>
      <require condition="S32K14x_CMSIS"/>
    </condition>
    <condition id="S32K14x DRV_CRC">
      <description>NXP S32K Driver CRC dependency</description>
      <require condition="S32K14x_CMSIS"/>
    </condition>
    <condition id="S32K14x DRV_CSEC">
      <description>NXP S32K Driver CSEC dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK OSIF" Csub="OSIF"/>
    </condition>
    <condition id="S32K14x DRV_EDMA">
      <description>NXP S32K Driver eDMA dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K14x DRV_EIM">
      <description>NXP S32K Driver EIM dependency</description>
      <require condition="S32K14x_CMSIS"/>
    </condition>
    <condition id="S32K148 DRV_ENET">
      <description>NXP S32K48 Driver ENET dependency</description>
      <require condition="S32K148"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K148 DRV_PHY">
      <description>NXP S32K148 Driver PHY dependency</description>
      <require condition="S32K148"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="ENET"/>
    </condition>
    <condition id="S32K14x DRV_ERM">
      <description>NXP S32K Driver ERM dependency</description>
      <require condition="S32K14x_CMSIS"/>
    </condition>
    <condition id="S32K14x DRV_EWM">
      <description>NXP S32K Driver EWM dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K148 DRV_FLASH_MX25">
      <description>NXP S32K148 Driver FLASH MX25l6433F dependency</description>
      <require condition="S32K148"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="QSPI"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K14x DRV_FTM">
      <description>NXP S32K Driver FTM dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K14x DRV_FTM_IC">
      <description>NXP S32K Driver FTM dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FTM"/>
    </condition>
