XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.S32_SDK_DFP.pdsc
    <condition id="S32K14x DRV_FTM_MC">
      <description>NXP S32K Driver FTM dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FTM"/>
    </condition>
    <condition id="S32K14x DRV_FTM_OC">
      <description>NXP S32K Driver FTM dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FTM"/>
    </condition>
    <condition id="S32K14x DRV_FTM_PWM">
      <description>NXP S32K Driver FTM dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FTM"/>
    </condition>
    <condition id="S32K14x DRV_FTM_QD">
      <description>NXP S32K Driver FTM dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FTM"/>
    </condition>
    <condition id="S32K14x DRV_FlexCAN">
      <description>NXP S32K Driver FlexCAN dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K14x DRV_FlexIO">
      <description>NXP S32K Driver FLEXIO dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K14x DRV_FlexIO_I2C">
      <description>NXP S32K Driver FLEXIO I2C dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="S32K14x DRV_FlexIO_I2S">
      <description>NXP S32K Driver FLEXIO I2S dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="S32K14x DRV_FlexIO_SPI">
      <description>NXP S32K Driver FLEXIO SPI dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="S32K14x DRV_FlexIO_UART">
      <description>NXP S32K Driver FLEXIO UART dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="S32K14x DRV_LIN">
      <description>NXP S32K Driver LIN dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="LPUART"/>
    </condition>
    <condition id="S32K14x DRV_LPI2C">
      <description>NXP S32K Driver LPI2C dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K14x DRV_LPIT">
      <description>NXP S32K Driver LPIT dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K14x DRV_LPSPI">
      <description>NXP S32K Driver LPSPI dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K14x DRV_LPTMR">
      <description>NXP S32K Driver LPTMR dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
    </condition>
    <condition id="S32K14x DRV_LPUART">
      <description>NXP S32K Driver LPUART IRQ dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K14x DRV_MPU">
      <description>NXP S32K Driver MPU dependency</description>
      <require condition="S32K14x_CMSIS"/>
    </condition>
    <condition id="S32K14x DRV_PDB">
      <description>NXP S32K Driver PDB dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K14x DRV_PINS">
      <description>NXP S32K Driver PINS dependency</description>
      <require condition="S32K14x_CMSIS"/>
    </condition>
    <condition id="S32K14x DRV_Power">
      <description>NXP S32K14x System Power dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
    </condition>
    <condition id="S32K148 DRV_QSPI">
      <description>NXP S32K Driver QSPI dependency</description>
      <require condition="S32K148"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K14x DRV_RTC">
      <description>NXP S32K Driver RTC dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K148 DRV_SAI">
      <description>NXP S32K148 Driver SAI dependency</description>
      <require condition="S32K148"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K14x DRV_TRGMUX">
      <description>NXP S32K Driver TRGMUX dependency</description>
      <require condition="S32K14x_CMSIS"/>
    </condition>
    <condition id="S32K14x DRV_WDOG">
      <description>NXP S32K Driver WDOG dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>

    <!-- SDK PAL dependencies -->
    <condition id="S32K14x PAL_ADC">
      <description>NXP S32K14x PAL ADC dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="ADC"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="PDB"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="TRGMUX"/>
      <require Cclass="Device" Cgroup="SDK OSIF" Csub="OSIF"/>
    </condition>
