XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.S32_SDK_DFP.pdsc
    <condition id="S32K14x PAL_CAN">
      <description>NXP S32K14x PAL CAN dependency</description>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexCAN"/>
      <require condition="S32K14x_CMSIS"/>
    </condition>
    <condition id="S32K14x PAL_I2C">
      <description>NXP S32K14x PAL I2C dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="LPI2C"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO (I2C)"/>
    </condition>
    <condition id="S32K142_144_146 PAL_I2S">
      <description>NXP S32K142 144 146 PAL I2S dependency</description>
      <require condition="S32K142_144_146"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO (I2S)"/>
    </condition>
    <condition id="S32K148 PAL_I2S">
      <description>NXP S32K148 PAL I2S dependency</description>
      <require condition="S32K148"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO (I2S)"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="SAI"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="PINS"/>
    </condition>
    <condition id="S32K14x PAL_I2S">
      <description>NXP S32K14x PAL I2S dependency</description>
      <accept condition="S32K142_144_146 PAL_I2S"/>
      <accept condition="S32K148 PAL_I2S"/>
    </condition>
    <condition id="S32K14x PAL_IC">
      <description>NXP S32K14x PAL IC dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FTM (IC)"/>
    </condition>
    <condition id="S32K14x PAL_MPU">
      <description>NXP S32K14x PAL MPU dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="MPU"/>
    </condition>
    <condition id="S32K14x PAL_OC">
      <description>NXP S32K14x PAL OC dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FTM (OC)"/>
    </condition>
    <condition id="S32K14x PAL_PWM">
      <description>NXP S32K14x PAL PWM dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FTM (PWM)"/>
    </condition>
    <condition id="S32K14x PAL_Security">
      <description>NXP S32K14x PAL Security dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="CSEC"/>
      <require Cclass="Device" Cgroup="SDK OSIF" Csub="OSIF"/>
    </condition>
    <condition id="S32K14x PAL_SPI">
      <description>NXP S32K14x PAL SPI dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="LPSPI"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO (SPI)"/>
    </condition>
    <condition id="S32K14x PAL_Timing">
      <description>NXP S32K14x PAL Timing dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FTM (OC)"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="LPIT"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="LPTMR"/>
    </condition>
    <condition id="S32K14x PAL_UART">
      <description>NXP S32K14x PAL UART dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="LPUART"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO (UART)"/>
    </condition>
    <condition id="S32K14x PAL_WDG">
      <description>NXP S32K14x PAL WDG dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="WDOG"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
    </condition>

    <condition id="S32K14x OSIF_BM">
      <description>NXP S32K14x OSIF Bare Metal dependency</description>
      <require condition="S32K14x_CMSIS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>

  </conditions>

  <components>
    <!-- StartUp -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="S32K14x_CMSIS">
      <description>System Startup for NXP S32K14x Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_S32K14x      /* Device Startup for S32K14x Series */
      </RTE_Components_h>
      <files>
        <!-- include folders -->
        <file category="header"  name="platform/devices/device_registers.h"/> <!-- generates warning in PackCheck because name is not CMSIS conform -->
        <file category="include" name="platform/devices/"/>
        <file category="include" name="platform/devices/common/"/>

        <!-- startup files (general) -->
        <file category="source" name="platform/devices/startup.c"/>

        <!-- system files -->
        <file category="header"       condition="S32K142"         name="platform/devices/S32K142/startup/system_S32K142.h"            attr="config" version="1.1.0"/>
        <file category="source"       condition="S32K142"         name="platform/devices/S32K142/startup/system_S32K142.c"            attr="config" version="1.1.0"/>
        <file category="header"       condition="S32K144"         name="platform/devices/S32K144/startup/system_S32K144.h"            attr="config" version="2.1.0"/>
        <file category="source"       condition="S32K144"         name="platform/devices/S32K144/startup/system_S32K144.c"            attr="config" version="2.1.0"/>
        <file category="header"       condition="S32K146"         name="platform/devices/S32K146/startup/system_S32K146.h"            attr="config" version="1.1.0"/>
        <file category="source"       condition="S32K146"         name="platform/devices/S32K146/startup/system_S32K146.c"            attr="config" version="1.1.0"/>
        <file category="header"       condition="S32K148"         name="platform/devices/S32K148/startup/system_S32K148.h"            attr="config" version="1.1.0"/>
        <file category="source"       condition="S32K148"         name="platform/devices/S32K148/startup/system_S32K148.c"            attr="config" version="1.1.0"/>
        <file category="header"       condition="S32K142W"        name="platform/devices/S32K142W/startup/system_S32K142W.h"          attr="config" version="2.1.0"/>
        <file category="source"       condition="S32K142W"        name="platform/devices/S32K142W/startup/system_S32K142W.c"          attr="config" version="2.1.0"/>
        <file category="header"       condition="S32K144W"        name="platform/devices/S32K144W/startup/system_S32K144W.h"          attr="config" version="2.1.0"/>
        <file category="source"       condition="S32K144W"        name="platform/devices/S32K144W/startup/system_S32K144W.c"          attr="config" version="2.1.0"/>

