XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.S32_SDK_DFP.pdsc
        <!-- startup files (ARM specific) -->
        <file category="source"       condition="S32K142_ARM"     name="platform/devices/S32K142/startup/armc/startup_S32K142.S"      attr="config" version="2.2.0"/>
        <file category="source"       condition="S32K144_ARM"     name="platform/devices/S32K144/startup/armc/startup_S32K144.S"      attr="config" version="2.2.0"/>
        <file category="source"       condition="S32K146_ARM"     name="platform/devices/S32K146/startup/armc/startup_S32K146.S"      attr="config" version="2.2.0"/>
        <file category="source"       condition="S32K148_ARM"     name="platform/devices/S32K148/startup/armc/startup_S32K148.S"      attr="config" version="2.2.0"/>
        <file category="source"       condition="S32K142W_ARM"    name="platform/devices/S32K142W/startup/armc/startup_S32K142W.S"    attr="config" version="2.2.0"/>
        <file category="source"       condition="S32K144W_ARM"    name="platform/devices/S32K144W/startup/armc/startup_S32K144W.S"    attr="config" version="2.2.0"/>

        <!-- startup files (GCC specific) -->
        <file category="source"       condition="S32K142_GCC"     name="platform/devices/S32K142/startup/gcc/startup_S32K142.S"       attr="config" version="1.0.0"/>
        <file category="source"       condition="S32K144_GCC"     name="platform/devices/S32K144/startup/gcc/startup_S32K144.S"       attr="config" version="2.0.0"/>
        <file category="source"       condition="S32K146_GCC"     name="platform/devices/S32K146/startup/gcc/startup_S32K146.S"       attr="config" version="1.0.0"/>
        <file category="source"       condition="S32K148_GCC"     name="platform/devices/S32K148/startup/gcc/startup_S32K148.S"       attr="config" version="1.0.0"/>
        <file category="source"       condition="S32K142W_GCC"    name="platform/devices/S32K142W/startup/gcc/startup_S32K142W.S"     attr="config" version="2.0.0"/>
        <file category="source"       condition="S32K144W_GCC"    name="platform/devices/S32K144W/startup/gcc/startup_S32K144W.S"     attr="config" version="2.0.0"/>

        <!-- linker scripts (ARM)-->
        <file category="linkerScript" condition="S32K142_32_ARM"  name="platform/devices/S32K142/linker/armc/S32K142_32_flash.sct"    attr="config" version="2.2.0"/>
        <file category="linkerScript" condition="S32K142_32_ARM"  name="platform/devices/S32K142/linker/armc/S32K142_32_ram.sct"      attr="config" version="2.2.0"/>
        <file category="linkerScript" condition="S32K144_48_ARM"  name="platform/devices/S32K144/linker/armc/S32K144_48_flash.sct"    attr="config" version="2.2.0"/>
        <file category="linkerScript" condition="S32K144_48_ARM"  name="platform/devices/S32K144/linker/armc/S32K144_48_ram.sct"      attr="config" version="2.2.0"/>
        <file category="linkerScript" condition="S32K144_64_ARM"  name="platform/devices/S32K144/linker/armc/S32K144_64_flash.sct"    attr="config" version="2.2.0"/>
        <file category="linkerScript" condition="S32K144_64_ARM"  name="platform/devices/S32K144/linker/armc/S32K144_64_ram.sct"      attr="config" version="2.2.0"/>
        <file category="linkerScript" condition="S32K146_128_ARM" name="platform/devices/S32K146/linker/armc/S32K146_128_flash.sct"   attr="config" version="2.2.0"/>
        <file category="linkerScript" condition="S32K146_128_ARM" name="platform/devices/S32K146/linker/armc/S32K146_128_ram.sct"     attr="config" version="2.2.0"/>
        <file category="linkerScript" condition="S32K148_192_ARM" name="platform/devices/S32K148/linker/armc/S32K148_192_flash.sct"   attr="config" version="2.2.0"/>
        <file category="linkerScript" condition="S32K148_192_ARM" name="platform/devices/S32K148/linker/armc/S32K148_192_ram.sct"     attr="config" version="2.2.0"/>
        <file category="linkerScript" condition="S32K148_256_ARM" name="platform/devices/S32K148/linker/armc/S32K148_256_flash.sct"   attr="config" version="2.2.0"/>
        <file category="linkerScript" condition="S32K148_256_ARM" name="platform/devices/S32K148/linker/armc/S32K148_256_ram.sct"     attr="config" version="2.2.0"/>
        <file category="linkerScript" condition="S32K142W_32_ARM" name="platform/devices/S32K142W/linker/armc/S32K142W_32_flash.sct"  attr="config" version="2.2.0"/>
        <file category="linkerScript" condition="S32K142W_32_ARM" name="platform/devices/S32K142W/linker/armc/S32K142W_32_ram.sct"    attr="config" version="2.2.0"/>
        <file category="linkerScript" condition="S32K144W_64_ARM" name="platform/devices/S32K144W/linker/armc/S32K144W_64_flash.sct"  attr="config" version="2.2.0"/>
        <file category="linkerScript" condition="S32K144W_64_ARM" name="platform/devices/S32K144W/linker/armc/S32K144W_64_ram.sct"    attr="config" version="2.2.0"/>

        <!-- linker scripts  (GCC) -->
        <file category="linkerScript" condition="S32K142_32_GCC"  name="platform/devices/S32K142/linker/gcc/S32K142_32_flash.ld"      attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="S32K142_32_GCC"  name="platform/devices/S32K142/linker/gcc/S32K142_32_ram.ld"        attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="S32K144_48_GCC"  name="platform/devices/S32K144/linker/gcc/S32K144_48_flash.ld"      attr="config" version="2.0.0"/>
        <file category="linkerScript" condition="S32K144_48_GCC"  name="platform/devices/S32K144/linker/gcc/S32K144_48_ram.ld"        attr="config" version="2.0.0"/>
        <file category="linkerScript" condition="S32K144_64_GCC"  name="platform/devices/S32K144/linker/gcc/S32K144_64_flash.ld"      attr="config" version="2.0.0"/>
        <file category="linkerScript" condition="S32K144_64_GCC"  name="platform/devices/S32K144/linker/gcc/S32K144_64_ram.ld"        attr="config" version="2.0.0"/>
        <file category="linkerScript" condition="S32K146_128_GCC" name="platform/devices/S32K146/linker/gcc/S32K146_128_flash.ld"     attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="S32K146_128_GCC" name="platform/devices/S32K146/linker/gcc/S32K146_128_ram.ld"       attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="S32K148_192_GCC" name="platform/devices/S32K148/linker/gcc/S32K148_192_flash.ld"     attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="S32K148_192_GCC" name="platform/devices/S32K148/linker/gcc/S32K148_192_ram.ld"       attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="S32K148_256_GCC" name="platform/devices/S32K148/linker/gcc/S32K148_256_flash.ld"     attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="S32K148_256_GCC" name="platform/devices/S32K148/linker/gcc/S32K148_256_ram.ld"       attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="S32K142W_32_GCC" name="platform/devices/S32K142W/linker/gcc/S32K142W_32_flash.ld"    attr="config" version="2.0.0"/>
        <file category="linkerScript" condition="S32K142W_32_GCC" name="platform/devices/S32K142W/linker/gcc/S32K142W_32_ram.ld"      attr="config" version="2.0.0"/>
        <file category="linkerScript" condition="S32K144W_64_GCC" name="platform/devices/S32K144W/linker/gcc/S32K144W_64_flash.ld"    attr="config" version="2.0.0"/>
        <file category="linkerScript" condition="S32K144W_64_GCC" name="platform/devices/S32K144W/linker/gcc/S32K144W_64_ram.ld"      attr="config" version="2.0.0"/>
      </files>
    </component>

