XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.S32_SDK_DFP.pdsc
    <!-- SDK PAL -->
    <component Cclass="Device" Cgroup="SDK PAL"    Csub="ADC"                Cversion="4.0.2" condition="S32K14x PAL_ADC">
      <description>ADC Peripheral Abstraction Layer (ADC PAL)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_PAL_ADC
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/pal/inc/adc_pal.h"/>
        <file category="source" name="platform/pal/src/adc/adc_pal.c"/>
        <file category="source" name="platform/pal/src/adc/adc_irq.c"/>

        <file category="header" name="platform/pal/cfg/adc_pal_cfg.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK PAL"    Csub="CAN"                Cversion="4.0.2" condition="S32K14x PAL_CAN">
      <description>CAN Peripheral Abstraction Layer (CAN PAL)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_PAL_CAN
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/pal/inc/can_pal.h"/>
        <file category="source" name="platform/pal/src/can/can_pal.c"/>

        <file category="header" name="platform/pal/cfg/can_pal_cfg.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK PAL"    Csub="I2C"                Cversion="4.0.2" condition="S32K14x PAL_I2C">
      <description>I2C Peripheral Abstraction Layer (I2C PAL)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_PAL_I2C
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/pal/inc/i2c_pal.h"/>
        <file category="source" name="platform/pal/src/i2c/i2c_pal.c"/>

        <file category="header" name="platform/pal/cfg/i2c_pal_cfg.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK PAL"    Csub="I2S"                Cversion="4.0.2" condition="S32K14x PAL_I2S">
      <description>I2S Peripheral Abstraction Layer (I2S PAL)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_PAL_I2S
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/pal/inc/i2s_pal.h"/>
        <file category="source" name="platform/pal/src/i2s/i2s_pal.c"/>

        <file category="header" name="platform/pal/cfg/i2s_pal_cfg.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK PAL"    Csub="IC"                 Cversion="4.0.2" condition="S32K14x PAL_IC">
      <description>IC Peripheral Abstraction Layer (IC PAL)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_PAL_IC
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/pal/inc/ic_pal.h"/>
        <file category="source" name="platform/pal/src/ic/ic_pal.c"/>
        <file category="source" name="platform/pal/src/ic/ic_irq.c"/>

        <file category="header" name="platform/pal/cfg/ic_pal_cfg.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK PAL"    Csub="MPU"                Cversion="4.0.2" condition="S32K14x PAL_MPU">
      <description>MPU Peripheral Abstraction Layer (MPU PAL)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_PAL_MPU
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/pal/inc/mpu_pal.h"/>
        <file category="source" name="platform/pal/src/mpu/mpu_pal.c"/>

        <file category="header" name="platform/pal/cfg/mpu_pal_cfg.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK PAL"    Csub="OC"                 Cversion="4.0.2" condition="S32K14x PAL_OC">
      <description>OC Peripheral Abstraction Layer (OC PAL)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_PAL_OC
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/pal/inc/oc_pal.h"/>
        <file category="source" name="platform/pal/src/oc/oc_pal.c"/>
        <file category="source" name="platform/pal/src/oc/oc_irq.c"/>

        <file category="header" name="platform/pal/cfg/oc_pal_cfg.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK PAL"    Csub="PWM"                Cversion="4.0.2" condition="S32K14x PAL_PWM">
      <description>PWM Peripheral Abstraction Layer (PWM PAL)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_PAL_PWM
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/pal/inc/pwm_pal.h"/>
        <file category="source" name="platform/pal/src/pwm/pwm_pal.c"/>

        <file category="header" name="platform/pal/cfg/pwm_pal_cfg.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK PAL"    Csub="Security"           Cversion="4.0.2" condition="S32K14x PAL_Security">
      <description>Security Peripheral Abstraction Layer (Security PAL)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_PAL_SECURITY
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/pal/inc/security_pal.h"/>
        <file category="source" name="platform/pal/src/security/security_pal.c"/>

        <file category="header" name="platform/pal/cfg/security_pal_cfg.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK PAL"    Csub="SPI"                Cversion="4.0.2" condition="S32K14x PAL_SPI">
      <description>SPI Peripheral Abstraction Layer (SPI PAL)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_PAL_SPI
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/pal/inc/spi_pal.h"/>
        <file category="source" name="platform/pal/src/spi/spi_pal.c"/>

        <file category="header" name="platform/pal/cfg/spi_pal_cfg.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK PAL"    Csub="Timing"             Cversion="4.0.2" condition="S32K14x PAL_Timing">
      <description>Timing Peripheral Abstraction Layer (Timing PAL)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_PAL_TIMING
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/pal/inc/timing_pal.h"/>
        <file category="source" name="platform/pal/src/timing/timing_pal.c"/>
        <file category="source" name="platform/pal/src/timing/timing_irq.c"/>

        <file category="header" name="platform/pal/cfg/timing_pal_cfg.h" attr="config" version="1.0.0"/>
      </files>
    </component>
