XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.S32_SDK_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK PAL"    Csub="UART"               Cversion="4.0.2" condition="S32K14x PAL_UART">
      <description>UART Peripheral Abstraction Layer (UART PAL)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_PAL_UART
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/pal/inc/uart_pal.h"/>
        <file category="source" name="platform/pal/src/uart/uart_pal.c"/>

        <file category="header" name="platform/pal/cfg/uart_pal_cfg.h" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK PAL"    Csub="WDG"                Cversion="4.0.2" condition="S32K14x PAL_WDG">
      <description>WDG Peripheral Abstraction Layer (WDG PAL)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_PAL_WDG
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/pal/inc/wdg_pal.h"/>
        <file category="source" name="platform/pal/src/wdg/wdg_pal.c"/>

        <file category="header" name="platform/pal/cfg/wdg_pal_cfg.h" attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- SDK Driver -->
    <component Cclass="Device" Cgroup="SDK Driver" Csub="ADC"                Cversion="4.0.2" condition="S32K14x DRV_ADC">
      <description>Analog to Digital Converter Peripheral (ADC) Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_ADC
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/adc_driver.h"/>
        <file category="source" name="platform/drivers/src/adc/adc_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="Clock"              Cversion="4.0.2" condition="S32K14x DRV_Clock">
      <description>Clock Manager Driver (SK32K1xx)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_CLOCK
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/clock_manager.h"/>
        <file category="header" name="platform/drivers/src/clock/S32K1xx/clock_S32K1xx.h"/>
        <file category="source" name="platform/drivers/src/clock/S32K1xx/clock_S32K1xx.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="CMP"                Cversion="4.0.2" condition="S32K14x DRV_CMP">
      <description>Comparator (CMP) Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_CMP
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/cmp_driver.h"/>
        <file category="source" name="platform/drivers/src/cmp/cmp_driver.c"/>
        <file category="source" name="platform/drivers/src/cmp/cmp_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="CRC"                Cversion="4.0.2" condition="S32K14x DRV_CRC">
      <description>Cyclic Redundancy Check (CRC) Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_CRC
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/crc_driver.h"/>
        <file category="source" name="platform/drivers/src/crc/crc_driver.c"/>
        <file category="source" name="platform/drivers/src/crc/crc_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="CSEC"               Cversion="4.0.2" condition="S32K14x DRV_CSEC">
      <description>Cryptographic Services Engine (CSEc) Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_CSEC
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/csec_driver.h"/>
        <file category="source" name="platform/drivers/src/csec/csec_driver.c"/>
        <file category="source" name="platform/drivers/src/csec/csec_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"               Cversion="4.0.2" condition="S32K14x DRV_EDMA">
      <description>Enhanced Direct Memory Access (eDMA) Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_EDMA
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/edma_driver.h"/>
        <file category="source" name="platform/drivers/src/edma/edma_driver.c"/>
        <file category="source" name="platform/drivers/src/edma/edma_hw_access.c"/>
        <file category="source" name="platform/drivers/src/edma/edma_irq.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="EIM"                Cversion="4.0.2" condition="S32K14x DRV_EIM">
      <description>Error Injection Module (EIM) Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_EIM
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/eim_driver.h"/>
        <file category="source" name="platform/drivers/src/eim/eim_driver.c"/>
        <file category="source" name="platform/drivers/src/eim/eim_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="ENET"               Cversion="4.0.2" condition="S32K148 DRV_ENET">
      <description>Ethernet MAC (ENET) Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_ENET
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/enet_driver.h"/>
        <file category="source" name="platform/drivers/src/enet/enet_driver.c"/>
        <file category="source" name="platform/drivers/src/enet/enet_hw_access.c"/>
        <file category="source" name="platform/drivers/src/enet/enet_irq.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="ERM"                Cversion="4.0.2" condition="S32K14x DRV_ERM">
      <description>Error Reporting Module (ERM) Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_ERM
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/erm_driver.h"/>
        <file category="source" name="platform/drivers/src/erm/erm_driver.c"/>
        <file category="source" name="platform/drivers/src/erm/erm_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="EWM"                Cversion="4.0.2" condition="S32K14x DRV_EWM">
      <description>External Watchdog Monitor (EWM) Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_EWM
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/ewm_driver.h"/>
        <file category="source" name="platform/drivers/src/ewm/ewm_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="Flash"              Cversion="4.0.2" condition="S32K14x">
      <description>Flash Memory (Flash) Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLASH
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/flash_driver.h"/>
        <file category="source" name="platform/drivers/src/flash/flash_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="Flash (MX25l6433F)" Cversion="4.0.2" condition="S32K148 DRV_FLASH_MX25">
      <description>MX25L6433F Serial Flash Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLASH_MX25l6433F
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/flash_mx25l6433f_driver.h"/>
        <file category="source" name="platform/drivers/src/flash_mx25l6433f/flash_mx25l6433f_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FlexCAN"            Cversion="4.0.2" condition="S32K14x DRV_FlexCAN">
      <description>Controller Area Network with Flexible Data Rate (FlexCAN) Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLEXCAN
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/flexcan_driver.h"/>
        <file category="source" name="platform/drivers/src/flexcan/flexcan_driver.c"/>
        <file category="source" name="platform/drivers/src/flexcan/flexcan_hw_access.c"/>
        <file category="source" name="platform/drivers/src/flexcan/flexcan_irq.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO"             Cversion="4.0.2" condition="S32K14x DRV_FlexIO">
      <description>FlexIO Common Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLEXIO
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/flexio.h"/>
        <file category="source" name="platform/drivers/src/flexio/flexio_common.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO (I2C)"       Cversion="4.0.2" condition="S32K14x DRV_FlexIO_I2C">
      <description>FlexIO I2C Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLEXIO_I2C
      </RTE_Components_h>
      <files>
        <file category="source" name="platform/drivers/src/flexio/flexio_i2c_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO (I2S)"       Cversion="4.0.2" condition="S32K14x DRV_FlexIO_I2S">
      <description>FlexIO I2S Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLEXIO_I2S
      </RTE_Components_h>
      <files>
        <file category="source" name="platform/drivers/src/flexio/flexio_i2s_driver.c"/>
      </files>
    </component>
