XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.S32_SDK_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO (SPI)"       Cversion="4.0.2" condition="S32K14x DRV_FlexIO_SPI">
      <description>FlexIO SPI Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLEXIO_SPI
      </RTE_Components_h>
      <files>
        <file category="source" name="platform/drivers/src/flexio/flexio_spi_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO (UART)"      Cversion="4.0.2" condition="S32K14x DRV_FlexIO_UART">
      <description>FlexIO UART Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLEXIO_UART
      </RTE_Components_h>
      <files>
        <file category="source" name="platform/drivers/src/flexio/flexio_uart_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FTM"                Cversion="4.0.2" condition="S32K14x DRV_FTM">
      <description>FlexTimer Common Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FTM
      </RTE_Components_h>
      <files>
        <file category="header"  name="platform/drivers/inc/ftm_common.h"/>
        <file category="source"  name="platform/drivers/src/ftm/ftm_common.c"/>
        <file category="source"  name="platform/drivers/src/ftm/ftm_hw_access.c"/>
        <file category="include" name="platform/drivers/src/ftm/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FTM (IC)"           Cversion="4.0.2" condition="S32K14x DRV_FTM_IC">
      <description>FlexTimer Input Capture Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FTM_IC
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/ftm_ic_driver.h"/>
        <file category="source" name="platform/drivers/src/ftm/ftm_ic_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FTM (MC)"           Cversion="4.0.2" condition="S32K14x DRV_FTM_MC">
      <description>FlexTimer Module Counter Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FTM_MC
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/ftm_mc_driver.h"/>
        <file category="source" name="platform/drivers/src/ftm/ftm_mc_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FTM (OC)"           Cversion="4.0.2" condition="S32K14x DRV_FTM_OC">
      <description>FlexTimer Output Compare Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FTM_OC
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/ftm_oc_driver.h"/>
        <file category="source" name="platform/drivers/src/ftm/ftm_oc_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FTM (PWM)"          Cversion="4.0.2" condition="S32K14x DRV_FTM_PWM">
      <description>FlexTimer Pulse Width Modulation Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FTM_PWM
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/ftm_pwm_driver.h"/>
        <file category="source" name="platform/drivers/src/ftm/ftm_pwm_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FTM (QD)"           Cversion="4.0.2" condition="S32K14x DRV_FTM_QD">
      <description>FlexTimer Quadrature Decoder Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FTM_QD
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/ftm_qd_driver.h"/>
        <file category="source" name="platform/drivers/src/ftm/ftm_qd_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"          Cversion="4.0.2" condition="S32K14x">
      <description>Interrupt Manager (Interrupt)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_INTERRUPT
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/interrupt_manager.h"/>
        <file category="source" name="platform/drivers/src/interrupt/interrupt_manager.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="LIN (LPUART)"       Cversion="4.0.2" condition="S32K14x DRV_LIN">
      <description>LIN Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_LIN
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/lin_driver.h"/>
        <file category="source" name="platform/drivers/src/lin/lin_common.c"/>
        <file category="source" name="platform/drivers/src/lin/lin_driver.c"/>
        <file category="source" name="platform/drivers/src/lin/lin_irq.c"/>

        <file category="include" name="platform/drivers/src/lpuart/"/>
        <file category="source" name="platform/drivers/src/lpuart/lin_lpuart_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="LPI2C"              Cversion="4.0.2" condition="S32K14x DRV_LPI2C">
      <description>Low Power Inter-Integrated Circuit (LPI2C) Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_LPI2C
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/lpi2c_driver.h"/>
        <file category="source" name="platform/drivers/src/lpi2c/lpi2c_driver.c"/>
        <file category="source" name="platform/drivers/src/lpi2c/lpi2c_hw_access.c"/>
        <file category="source" name="platform/drivers/src/lpi2c/lpi2c_irq.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="LPIT"               Cversion="4.0.2" condition="S32K14x DRV_LPIT">
      <description>Low Power Interrupt Timer (LPIT) Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_LPIT
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/lpit_driver.h"/>
        <file category="source" name="platform/drivers/src/lpit/lpit_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="LPSPI"              Cversion="4.0.2" condition="S32K14x DRV_LPSPI">
      <description>Low Power Serial Peripheral Interface (LPSPI) Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_LPSPI
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/lpspi_master_driver.h"/>
        <file category="header" name="platform/drivers/inc/lpspi_slave_driver.h"/>
        <file category="header" name="platform/drivers/inc/lpspi_shared_function.h"/>
        <file category="source" name="platform/drivers/src/lpspi/lpspi_master_driver.c"/>
        <file category="source" name="platform/drivers/src/lpspi/lpspi_slave_driver.c"/>
        <file category="source" name="platform/drivers/src/lpspi/lpspi_shared_function.c"/>
        <file category="source" name="platform/drivers/src/lpspi/lpspi_irq.c"/>
        <file category="source" name="platform/drivers/src/lpspi/lpspi_hw_access.c"/>
      </files>
    </component>
