XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.S32_SDK_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Driver" Csub="LPTMR"              Cversion="4.0.2" condition="S32K14x DRV_LPTMR">
      <description>Low Power Timer (LPTMR) Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_LPTMR
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/lptmr_driver.h"/>
        <file category="source" name="platform/drivers/src/lptmr/lptmr_driver.c"/>
        <file category="source" name="platform/drivers/src/lptmr/lptmr_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="LPUART"             Cversion="4.0.2" condition="S32K14x DRV_LPUART">
      <description>Low Power Universal Asynchronous Receiver-Transmitter (LPUART) Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_LPUART
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/lpuart_driver.h"/>
        <file category="source" name="platform/drivers/src/lpuart/lpuart_driver.c"/>
        <file category="source" name="platform/drivers/src/lpuart/lpuart_hw_access.c"/>
        <file category="source" name="platform/drivers/src/lpuart/lpuart_irq.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="MPU"                Cversion="4.0.2" condition="S32K14x DRV_MPU">
      <description>Memory Protection Unit (MPU) Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_MPU
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/mpu_driver.h"/>
        <file category="source" name="platform/drivers/src/mpu/mpu_driver.c"/>
        <file category="source" name="platform/drivers/src/mpu/mpu_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="PDB"                Cversion="4.0.2" condition="S32K14x DRV_PDB">
      <description>Programmable Delay Block (PDB) Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_PDB
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/pdb_driver.h"/>
        <file category="source" name="platform/drivers/src/pdb/pdb_driver.c"/>
        <file category="source" name="platform/drivers/src/pdb/pdb_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="PHY"                Cversion="4.0.2" condition="S32K148 DRV_PHY">
      <description>Ethernet Transciever (PHY) Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_ENET
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/phy/phy.h"/>
        <file category="source" name="platform/drivers/src/phy/phy.c"/>
        <file category="source" name="platform/drivers/src/phy/phy_enet_access.c"/>
        <file category="source" name="platform/drivers/src/phy/phy_generic.c"/>
        <file category="source" name="platform/drivers/src/phy/phy_shared.c"/>
        <file category="source" name="platform/drivers/src/phy/phy_tja110x.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="PINS"               Cversion="4.0.2" condition="S32K14x DRV_PINS">
      <description>Pins Driver (PINS)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_PINS
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/pins_driver.h"/>
        <file category="source" name="platform/drivers/src/pins/pins_driver.c"/>
        <file category="source" name="platform/drivers/src/pins/pins_port_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="Power"              Cversion="4.0.2" condition="S32K14x DRV_Power">
      <description>Power Manager Driver (SK32K1xx)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_POWER
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/power_manager.h"/>
        <file category="source" name="platform/drivers/src/power/power_manager.c"/>
        <file category="source" name="platform/drivers/src/power/S32K1xx/power_manager_S32K1xx.c"/>
        <file category="header" name="platform/drivers/src/power/S32K1xx/power_manager_S32K1xx.h"/>
        <file category="source" name="platform/drivers/src/power/S32K1xx/power_smc_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="QSPI"               Cversion="4.0.2" condition="S32K148 DRV_QSPI">
      <description>Quad Serial Peripheral Interface (QuadSPI)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_QSPI
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/quadspi_driver.h"/>
        <file category="source" name="platform/drivers/src/quadspi/quadspi_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="RTC"                Cversion="4.0.2" condition="S32K14x DRV_RTC">
      <description>Real Time Clock Driver (RTC)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_RTC
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/rtc_driver.h"/>
        <file category="source" name="platform/drivers/src/rtc/rtc_driver.c"/>
        <file category="source" name="platform/drivers/src/rtc/rtc_hw_access.c"/>
        <file category="source" name="platform/drivers/src/rtc/rtc_irq.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="SAI"                Cversion="4.0.2" condition="S32K148 DRV_SAI">
      <description>Synchronous Audio Interface (SAI)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_SAI
      </RTE_Components_h>
      <files>
        <file category="header"  name="platform/drivers/inc/sai_driver.h"/>
        <file category="include" name="platform/drivers/src/sai/"/>
        <file category="source"  name="platform/drivers/src/sai/sai_driver.c"/>
      </files>
    </component>
