XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.S32_SDK_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Driver" Csub="TRGMUX"             Cversion="4.0.2" condition="S32K14x DRV_TRGMUX">
      <description>TRGMUX Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_SAI
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/trgmux_driver.h"/>
        <file category="source" name="platform/drivers/src/trgmux/trgmux_driver.c"/>
        <file category="source" name="platform/drivers/src/trgmux/trgmux_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="WDOG"               Cversion="4.0.2" condition="S32K14x DRV_WDOG">
      <description>Watchdog timer (WDOG) Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_WDOG
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/drivers/inc/wdog_driver.h"/>
        <file category="source" name="platform/drivers/src/wdog/wdog_driver.c"/>
        <file category="source" name="platform/drivers/src/wdog/wdog_hw_access.c"/>
      </files>
    </component>

    <!-- SDK OSA -->
    <component Cclass="Device" Cgroup="SDK OSIF" Csub="OSIF" Cvariant="Bare Metal" Cversion="4.0.2" condition="S32K14x OSIF_BM">
      <description>Bare Metal Abstraction Layer (no RTOS)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_OSIF_BM
      </RTE_Components_h>
      <files>
        <file category="header" name="rtos/osif/osif.h"/>
        <file category="source" name="rtos/osif/osif_baremetal.c"/>
      </files>
    </component>

    <bundle Cbundle="S32K144-EVB" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP S32K144-EVB Development Board</description>
      <doc>http://www.nxp.com/assets/documents/data/en/quick-start-guide/S32K144EVB-QSG.pdf</doc>
      <component Cgroup="LED"           Capiversion="1.0.0" condition="S32K144 DRV_CLOCK_PINS">
        <description>LED Interface for S32K144-EVB</description>
        <files>
          <file category="source" name="MDK/Boards/NXP/S32K144-EVB/Common/LED_S32K144-EVB.c"/>
        </files>
      </component>
      <component Cgroup="Buttons"       Capiversion="1.0.0" condition="S32K144 DRV_CLOCK_PINS">
        <description>Buttons Interface for S32K144-EVB</description>
        <files>
          <file category="source" name="MDK/Boards/NXP/S32K144-EVB/Common/Buttons_S32K144-EVB.c"/>
        </files>
      </component>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="S32K144 DRV_CLOCK_PINS_ADC">
        <description>A/D Converter Interface for S32K144-EVB</description>
        <files>
          <file category="source" name="MDK/Boards/NXP/S32K144-EVB/Common/ADC_S32K144-EVB.c"/>
        </files>
      </component>
    </bundle>

    <bundle Cbundle="S32K148-EVB" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP S32K148-EVB Development Board</description>
      <doc></doc>
      <component Cgroup="LED"           Capiversion="1.0.0" condition="S32K148 DRV_CLOCK_PINS">
        <description>LED Interface for S32K148-EVB</description>
        <files>
          <file category="source" name="MDK/Boards/NXP/S32K148-EVB/Common/LED_S32K148-EVB.c"/>
        </files>
      </component>
      <component Cgroup="Buttons"       Capiversion="1.0.0" condition="S32K148 DRV_CLOCK_PINS">
        <description>Buttons Interface for S32K148-EVB</description>
        <files>
          <file category="source" name="MDK/Boards/NXP/S32K148-EVB/Common/Buttons_S32K148-EVB.c"/>
        </files>
      </component>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="S32K148 DRV_CLOCK_PINS_ADC">
        <description>A/D Converter Interface for S32K148-EVB</description>
        <files>
          <file category="source" name="MDK/Boards/NXP/S32K148-EVB/Common/ADC_S32K148-EVB.c"/>
        </files>
      </component>
    </bundle>
  </components>

  <boards>
    <board name="S32K144-EVB" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="S32K144UAxxxLLx"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="S32K144*"/>
      <image small="MDK/Boards/NXP/S32K144-EVB/Documents/S32K144-EVB_small.png"
             large="MDK/Boards/NXP/S32K144-EVB/Documents/S32K144-EVB_large.png"/>
      <description>
        The S32K144EVB is a low-cost evaluation and development board for general purpose automotive applications.
        Based on the 32-bit Arm® Cortex®-M4F S32K14 MCU, the S32K144EVB offers a standard-based form factor compatible with the Arduino® UNO pin layout, providing a broad range of expansion board options for quick application prototyping and demonstration.
      </description>
      <book category="overview"  name="https://www.nxp.com/design/development-boards/automotive-development-platforms/s32k-mcu-platforms/s32k144-evaluation-board-for-general-purpose:S32K144EVB" title="S32K144 Evaulation Board"/>
      <book category="manual"    name="https://www.nxp.com/docs/en/quick-reference-guide/S32K144EVB-QSG.pdf"    title="S32K144EVB Quick Start guide"/>
      <feature type="ODbg"          n="1"              name="Onboard open-standard serial and debug adaptor (OpenSDA)"/>
      <feature type="PWR"           n="5"              name="USB Powered"/>
      <feature type="Button"        n="4"              name="Push-buttons: Reset, OpenSDA Reset, 2x User"/>
      <feature type="Button"        n="2"              name="2x capacitive touch"/>
      <feature type="LED"           n="1"              name="RGB LED"/>
      <feature type="Poti"          n="1"              name="Potentiometer for voltage and analog measurement"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="SDA 10 pin Cortex debug (0.05 inch connector)"/>
    </board>

    <board name="S32K148-EVB" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="S32K148UAxxxLQx"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="S32K148*"/>
      <image small="MDK/Boards/NXP/S32K148-EVB/Documents/S32K148-EVB_small.png"
             large="MDK/Boards/NXP/S32K148-EVB/Documents/S32K148-EVB_large.png"/>
      <description>
        The S32K148EVB is a low-cost evaluation and development board for general purpose automotive applications.
        Based on the 32-bit Arm® Cortex®-M4F S32K14 MCU, the S32K148EVB offers a standard-based form factor compatible with the Arduino® UNO pin layout, providing a broad range of expansion board options for quick application prototyping and demonstration.
      </description>
      <book category="overview"  name="https://www.nxp.com/design/development-boards/automotive-development-platforms/s32k-mcu-platforms/s32k148-evaluation-board-for-general-purpose:S32K148EVB" title="S32K148 Evaulation Board"/>
      <book category="manual"    name="https://www.nxp.com/docs/en/quick-reference-guide/S32K148EVB-QSG.pdf"    title="S32K148EVB Quick Start guide"/>
      <book category="schematic" name="https://www.nxp.com/downloads/en/schematics/S32K148EVB-SCH-29643-RA.pdf" title="S32K148EVB-Q144 Schematics"/>
      <feature type="ODbg"          n="1"              name="Onboard open-standard serial and debug adaptor (OpenSDA)"/>
      <feature type="PWR"           n="5"              name="USB Powered"/>
      <feature type="Button"        n="4"              name="Push-buttons: Reset, OpenSDA Reset, 2x User"/>
      <feature type="Button"        n="2"              name="2x capacitive touch"/>
      <feature type="LED"           n="1"              name="RGB LED"/>
      <feature type="Poti"          n="1"              name="Potentiometer for voltage and analog measurement"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="SDA 10 pin Cortex debug (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- S32K144-EVB FRDM Board -->
    <example name="CMSIS-RTOS2 (Keil RTX5) Blinky" doc="Abstract.txt" folder="MDK/Boards/NXP/S32K144-EVB/RTOS2_KeilRTX5_Blinky/">
      <description>CMSIS-RTOS2 (Keil RTX5) based Blinky example</description>
      <board name="S32K144-EVB" vendor="NXP" Dvendor="NXP:11" Dname="S32K144UAxxxLLx"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- S32K148-EVB FRDM Board -->
    <example name="CMSIS-RTOS2 (Keil RTX5) Blinky" doc="Abstract.txt" folder="MDK/Boards/NXP/S32K148-EVB/RTOS2_KeilRTX5_Blinky/">
      <description>CMSIS-RTOS2 (Keil RTX5) based Blinky example</description>
      <board name="S32K148-EVB" vendor="NXP" Dvendor="NXP:11" Dname="S32K148UAxxxLQx"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
